/*2.Направете програма, която да намира най-малко общо кратно на две числа. Пример: a=12, б=18, най-малко общо кратно = 36. 
Изпълнете първите две стъпки от процеса на компилация на тази програма и качете асембли кода заедно със задачата към заданието.*/

#include <stdio.h>

int main(){  
    int num1 = 18, num2 = 12, max, flag = 1;   
 
    max = (num1 > num2) ? num1 : num2;  
      
    while(flag)
    {  
        if (max % num1 == 0 && max % num2 == 0)  
        {  
            printf("Lcm is %d", max); 
            break;  
        }  
        max ++;
    }  

    return 0;
}  